import React, { useState } from 'react';

// Questions for both sections
const questionsSet1 = [
  {
    id: 1,
    text: 'ท่านสามารถค้นหาข้อมูลว่าจะต้องทำอะไรเมื่อประสบกรณีฉุกเฉินทางการแพทย์ เช่น พบคนตกน้ำ พบคนหมดสติ',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 2,
    text: 'ท่านสามารถค้นหาข้อมูลเกี่ยวกับอาการ หรือความเจ็บป่วยที่ต้องรีบไปโรงพยาบาล',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 3,
    text: 'ท่านสามารถค้นหาข้อมูลเกี่ยวกับการตรวจเช็คสุขภาพเบื้องต้น หรือการฉีดวัคซีนที่ควรได้รับ',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 4,
    text: 'ท่านสามารถค้นหาข้อมูลเกี่ยวกับการป้องกันตนเองจากโรคติดต่อต่างๆ เช่น ไข้หวัดใหญ่ ท้องร่วง',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 5,
    text: 'ท่านสามารถหาข้อมูลเกี่ยวกับวิธีการทำให้สุขภาพแข็งแรง เช่น การออกกำลังกาย การกินอาหารที่เหมาะสม',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 6,
    text: 'ท่านสามารถค้นหาข้อมูลเกี่ยวกับวิธีการจัดการความเครียดที่เหมาะสม',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 7,
    text: 'ท่านสามารถค้นหาข้อมูลที่เชื่อถือได้เกี่ยวกับยา เครื่องสำอาง สมุนไพร อาหารเสริม',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  { 
    id: 8,
    text: 'ท่านสามารถค้นหาข้อมูลที่เชื่อถือได้เกี่ยวกับการบริการเครื่องมือที่เกี่ยวข้องกับสุขภาพที่ออกมาใหม่ๆ (เช่น การผ่าตัดเทคนิคใหม่ๆ เครื่องวัดความดัน สายรัดข้อมืออัจฉริยะ)',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
];

const questionsSet2 = [
  {
    id: 1,
    text: 'เข้าใจเกี่ยวกับสิ่งที่หมอได้พูดกับท่าน',
    options: ['เข้าใจง่ายมาก', 'เข้าใจง่าย', 'เข้าใจยาก', 'เข้าใจยากมาก'],
  },
  {
    id: 2,
    text: 'เข้าใจเกี่ยวกับสิ่งที่พยาบาลได้พูดกับท่าน',
    options: ['เข้าใจง่ายมาก', 'เข้าใจง่าย', 'เข้าใจยาก', 'เข้าใจยากมาก'],
  },
  {
    id: 3,
    text: 'เข้าใจเกี่ยวกับสิ่งที่อาสาสมัครสาธารณสุข (อสม./อสส./ อสค.) ได้พูดกับท่าน',
    options: ['เข้าใจง่ายมาก', 'เข้าใจง่าย', 'เข้าใจยาก', 'เข้าใจยากมาก'],
  },
  {
    id: 4,
    text: 'เข้าใจเกี่ยวกับเรื่องที่เพื่อน หรือเพื่อนผู้ป่วยได้พูดกับคุณ',
    options: ['เข้าใจง่ายมาก', 'เข้าใจง่าย', 'เข้าใจยาก', 'เข้าใจยากมาก'],
  },
  {
    id: 5,
    text: 'เข้าใจกับเอกสารที่ได้มากับยาที่ซื้อเอง หรือที่ได้รับจากโรงพยาบาล',
    options: ['เข้าใจง่ายมาก', 'เข้าใจง่าย', 'เข้าใจยาก', 'เข้าใจยากมาก'],
  },
  {
    id: 6,
    text: 'เข้าใจข้อมูลจากสื่อสาธารณะ (โทรทัศน์ วิทยุ) สื่อออนไลน์ (เช่น ไลน์ เฟสบุค อินสตาแกรม) หรือป้ายประกาศว่าจะต้อง ทำอะไรบ้างเมื่อประสบกรณีฉุกเฉินทางการแพทย์',
    options: ['เข้าใจง่ายมาก', 'เข้าใจง่าย', 'เข้าใจยาก', 'เข้าใจยากมาก'],
  },
  {
    id: 7,
    text: 'เข้าใจคำแนะนำของแพทย์หรือเภสัชกรเรื่องวิธีการใช้ยา ที่แพทย์กำหนด',
    options: ['เข้าใจง่ายมาก', 'เข้าใจง่าย', 'เข้าใจยาก', 'เข้าใจยากมาก'],
  },
  { 
    id: 8,
    text: 'เข้าใจว่าเพราะเหตุใด คุณถึงควรได้รับการตรวจคัดกรองสุขภาพ',
    options: ['เข้าใจง่ายมาก', 'เข้าใจง่าย', 'เข้าใจยาก', 'เข้าใจยากมาก'],
  },
  {
    id: 9,
    text: 'เข้าใจว่าเพราะเหตุใดคุณถึงจำเป็นต้องได้รับวัคซีน',
    options: ['เข้าใจง่ายมาก', 'เข้าใจง่าย', 'เข้าใจยาก', 'เข้าใจยากมาก'],
  },
  {
    id: 10,
    text: 'เข้าใจคำเตือนเกี่ยวกับพฤติกรรมสุขภาพว่าสำคัญและจำเป็นอย่างไร เช่น การมีกิจกรรมทางกายคำเตือนไม่สูบบุหรี่ หรือ การดื่มแอลกอฮอล์ที่มากเกินไป',
    options: ['เข้าใจง่ายมาก', 'เข้าใจง่าย', 'เข้าใจยาก', 'เข้าใจยากมาก'],
  },
  {
    id: 11,
    text: 'เข้าใจข้อมูลเกี่ยวกับวิธีการที่จะทำให้สุขภาพจิตดี',
    options: ['เข้าใจง่ายมาก', 'เข้าใจง่าย', 'เข้าใจยาก', 'เข้าใจยากมาก'],
  },
  {
    id: 12,
    text: 'เข้าใจฉลากยา เครื่องสำอาง อาหารเสริม สมุนไพรเครื่องมือแพทย์ วัตถุอันตราย',
    options: ['เข้าใจง่ายมาก', 'เข้าใจง่าย', 'เข้าใจยาก', 'เข้าใจยากมาก'],
  },
  {
    id: 13,
    text: 'เข้าใจบริการสุขภาพที่ออกมาใหม่ๆ เช่น กำไลปรับสมดุล การผ่าตัดเทคนิคใหม่ๆ',
    options: ['เข้าใจง่ายมาก', 'เข้าใจง่าย', 'เข้าใจยาก', 'เข้าใจยากมาก'],
  },
];

const questionsSet3 = [
    {
    id: 1,
    text: 'ท่านทบทวนข้อมูลที่ได้จากแพทย์',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
  },
  {
    id: 2,
    text: 'ท่านทบทวนข้อมูลที่ได้จากพยาบาล',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
 },
  {
    id: 3,
    text: 'ท่านทบทวนข้อมูลที่ได้จากเภสัชกร',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
  },
  {
    id: 4,
    text: 'ท่านทบทวนข้อมูลที่ได้จาก อาสาสมัครสาธารณสุข (อสม. อสส. อสค.)',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
  },
  {
    id: 5,
    text: 'ท่านทบทวนข้อมูลที่ได้จาก เพื่อนผู้ป่วย',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
  },
  {
    id: 6,
    text: 'ท่านทบทวนข้อมูลที่ได้จาก เพื่อนผู้ป่วย',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
  },
  {
    id: 7,
    text: 'ท่านซักถามข้อมูลเกี่ยวกับ การทำให้สุขภาพแข็งแรง จากแพทย์',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
  },
  { 
    id: 8,
    text: 'ท่านซักถามข้อมูลเกี่ยวกับ การทำให้สุขภาพแข็งแรง จากพยาบาล',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
  },
  {
    id: 9,
    text: 'ท่านซักถามข้อมูลเกี่ยวกับ การทำให้สุขภาพแข็งแรงจากอาสาสมัครสาธารณสุข (อสม. อสส. อสค.)',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
  },
  {
    id: 10,
    text: 'ท่านซักถามข้อมูลเกี่ยวกับโรค และการปฏิบัติตัวเพื่อป้องกันโรค จากแพทย์',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
  },
  {
    id: 11,
    text: 'ท่านซักถามข้อมูลเกี่ยวกับโรค และการปฏิบัติตัวเพื่อป้องกันโรค จากพยาบาล',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
  },
  {
    id: 12,
    text: 'ท่านซักถามข้อมูลเกี่ยวกับ โรค และการปฏิบัติตัวเพื่อ ป้องกันโรค จากอาสาสมัครสาธารณสุข (อสม. อสส. อสค.)',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
  },
  {
    id: 13,
    text: 'ท่านซักถามข้อมูลเกี่ยวกับผลิตภัณฑ์สุขภาพ (เช่น ยา  อาหารเสริม เครื่องสำอาง สมุนไพร) จากแพทย์',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
  },
  {
    id: 14,
    text: 'ท่านซักถามข้อมูลเกี่ยวกับ ผลิตภัณฑ์สุขภาพ (เช่น ยา  อาหารเสริม เครื่องสำอาง สมุนไพร) จากพยาบาล',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
  },
  {
    id: 15,
    text: 'ท่านซักถามข้อมูลเกี่ยวกับ ผลิตภัณฑ์สุขภาพ (เช่น ยา  อาหารเสริม เครื่องสำอาง สมุนไพร) จากอาสาสมัคร สาธารณสุข (อสม. อสส. อสค.)',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],  
 },
  { 
    id: 16,
    text: 'ท่านซักถามข้อมูลเกี่ยวกับ สิทธิ ค่าใช้จ่าย และข้อสงสัย ต่างๆ จากแพทย์',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
  },
  {
    id: 17,
    text: 'ท่านซักถามข้อมูลเกี่ยวกับ สิทธิ ค่าใช้จ่าย และข้อสงสัย ต่างๆ จาก พยาบาล',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
  },
  {
    id: 18,
    text: 'ท่านซักถามข้อมูลเกี่ยวกับ สิทธิ ค่าใช้จ่าย และข้อสงสัยต่างๆ  จาก เจ้าหน้าที่ที่โรงพยาบาล/สถานพยาบาล',
    options: ['ทุกครั้ง', 'บ่อยครั้ง', 'บางครั้ง', 'ไม่เคยทำ'],
  },
];

const questionsSet4 = [
    {
    id: 1,
    text: 'หลังจากได้ข้อมูล เรื่องการออกกำลังกาย ทำให้ท่านตัดสินใจ ได้ว่าท่านควรออกกำลังกายอย่างไร',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 2,
    text: 'หลังจากได้ข้อมูล เรื่อง การรับประทานอาหารที่ดีต่อสุขภาพ ทำให้ท่านตัดสินใจได้ว่า ท่านควรเลือกซื้อ หรือปรุงอาหาร อย่างไร',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 3,
    text: 'หลังจากได้ข้อมูล เรื่องวิธีการคลายเครียด ทำให้ท่านตัดสินใจ ได้ว่าท่านควรทำกิจกรรมอะไร เพื่อลดความเครียด',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 4,
    text: 'หลังจากได้ข้อมูลเกี่ยวกับโรค และการรักษา ทำให้ท่าน ตัดสินใจได้ว่าท่าน ต้องจัดการตนเองอย่างไร เพื่อทำตามแผนการรักษาอย่างครบถ้วน',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 5,
    text: 'หลังจากได้ข้อมูล เรื่อง อาหารเสริม สมุนไพรทำให้ท่าน ตัดสินใจได้ว่าท่านควรเลือกใช้อย่างไร',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 6,
    text: 'หลังจากได้ข้อมูลเกี่ยวกับการใช้ยา ทำให้ท่านตัดสินใจได้ว่า ท่านจะจัดการตนเองอย่างไร เพื่อใช้ยาได้ถูกต้อง ครบถ้วน',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 7,
    text: 'หลังจากได้ข้อมูลเกี่ยวกับการเกิดเหตุฉุกเฉิน ไม่ว่าจะเป็นกรณี อุบัติเหตุ หรือเจ็บป่วย ท่านสามารถปฏิบัติตามได้อย่างมั่นใจ',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
];

const questionsSet5 = [
    {
    id: 1,
    text: 'กินอาหาร ไม่หวาน ไม่มัน ไม่เค็ม',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 2,
    text: 'กินผักผลไม้เพิ่มขึ้น',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 3,
    text: 'กินอาหารที่ปรุงสุกใหม่',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 4,
    text: 'ใช้ช้อนกลางเมื่อรับประทานอาหารร่วมกับผู้อื่น',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 5,
    text: 'ล้างมือให้สะอาด ก่อนและหลัง กินอาหาร',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 6,
    text: 'ดื่มน้ำสะอาด 6 - 8 แก้วต่อวัน',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 7,
    text: 'กินอาหารให้ครบทั้งเนื้อสัตว์ ผัก ข้าว ผลไม้ และสับเปลี่ยน รายการอาหาร โดยไม่จำเป็น ต้องกินอาหารเสริม',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  { 
    id: 8,
    text: 'ออกแรงเพื่อเสริมสร้างความแข็งแรงให้แก่กล้ามเนื้อ วันเว้น วัน',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 9,
    text: 'นอนหลับ(สนิท) 7-8 ชั่วโมงต่อคืน',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 10,
    text: 'จัดการความเครียดของตนเองได้อย่างเหมาะสม',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 11,
    text: 'ไม่สูบบุหรี่หรือสูดดมควันบุหรี่',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 12,
    text: 'ไม่ดื่มเครื่องดื่มแอลกอฮอล์',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 13,
    text: 'แปรงฟันด้วยยาสีฟันผสมฟลูออไรด์อย่างน้อยครั้งละ 2 นาที',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 14,
    text: 'แปรงฟันวันละ 2 ครั้ง',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 15,
    text: 'งดกินอาหารหลังแปรงฟัน 2 ชั่วโมง',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  { 
    id: 16,
    text: 'อ่านและตรวจสอบข้อมูลเกี่ยวกับเครื่องสำอาง โดยดูที่มีเครื่องหมายรับรองมาตรฐาน การผลิตที่ดี (GMP)',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 17,
    text: 'อ่านและตรวจสอบข้อมูลเกี่ยวกับ อาหาร หรือผลิตภัณฑ์ลด ความอ้วน โดยดูที่มีเครื่องหมาย รับรองมาตรฐานการผลิตที่ดี (GMP)',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 18,
    text: 'อ่านและตรวจสอบข้อมูลเกี่ยวกับ อาหารเสริมสุขภาพหรือ สมุนไพร โดยดูที่มีเครื่องหมาย รับรองมาตรฐานการผลิตที่ดี (GMP)',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 19,
    text: 'ค้นคว้าตรวจสอบผลิตภัณฑ์และบริการสุขภาพ เครื่องสำอาง เครื่องมือแพทย์ วัตถุอันตราย จากแหล่งที่เชื่อถือได้ และรู้ว่าร้องเรียนได้ที่ใด',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 20,
    text: 'รักษาสิ่งแวดล้อมด้วยการลดปริมาณขยะ (ลดการใช้โฟมและพลาสติกที่ใช้แล้วทิ้ง ใช้ภาชนะที่เหมาะ กับการบรรจุอาหารแทน อาหารร้อนจัดต้องใช้วัสดุที่ เหมาะสม ใช้ถุงผ้าหรือกระเป๋าแทนถุงพลาสติก)',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 21,
    text: 'เก็บบ้านไม่ให้รก',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 22,
    text: 'เก็บขยะ',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 23,
    text: 'ปิดภาชนะเก็บน้ำให้มิดชิด',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  { 
    id: 24,
    text: 'กำจัดฝุ่นและควันในบ้าน',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 25,
    text: 'งดการเผาขยะ ลดการจุดธูป ไม่สูบบุหรี่ในบ้าน',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 26,
    text: 'ทำความสะอาดเครื่องปรับอากาศอย่างถูกวิธี',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 27,
    text: 'ปลูกต้นไม้ช่วยลดมลพิษ',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 28,
    text: 'ปรับโครงสร้างและสภาพแวดล้อมของบ้านให้เหมาะสมกับ ผู้สูงอายุ',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 29,
    text: 'ปฏิบัติตามคำแนะนำแพทย์ เภสัชกรและเฝ้าระวังหากต้องใช้ ยาปฏิชีวนะและยาที่ทำให้เสพติด (ยาแก้ปวด หรือยาแก้ไอ บางชนิด) ได้',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 30,
    text: 'ดูแลตัวเองเมื่อเจ็บป่วยเบื้องต้น ด้วยยาสมุนไพรในงาน สาธารณสุขมูลฐาน ยาสามัญประจำบ้าน ทั้งแผนปัจจุบันและ แผนโบราณ และใช้ยาเท่าที่จำเป็น',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 31,
    text: 'ใช้ถุงยางอนามัยเพื่อป้องกันการติดเชื้อเอชไอวี โรคติดต่อทาง เพศสัมพันธ์ และการตั้งครรภ์ ไม่พึงประสงค์',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  { 
    id: 32,
    text: 'ใส่หมวกนิรภัย เมื่อใช้จักรยานยนต์',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 33,
    text: 'ขับรถยนต์ไม่เกิน 60 กม.ต่อ ชม. ในพื้นที่เขตเมือง',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 34,
    text: 'คาดเข็มขัดนิรภัยเมื่อใช้รถยนต์',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  { 
    id: 35,
    text: 'ไม่ขับรถยนต์ หรือจักรยานยนต์ เมื่อง่วง เหนื่อยล้า หรือเมา',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 36,
    text: 'หากเราพบคนตกน้ำให้ช่วยด้วยวิธี “ตะโกน โยน ยื่น” และ โทร 1669 ห้ามจับอุ้มพาดบ่า/กดท้อง/ห้อยหัว เพื่อเอาน้ำออก ต้องช่วยด้วยการเป่าปากสลับกับการกดนวดหัวใจ',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 37,
    text: 'ห้ามหญิงตั้งครรภ์ดื่มเครื่องดื่มที่มีแอลกอฮอล์ เพราะอาจทำให้คลอดก่อนกำหนด ทารกตายในครรภ์ หรือเกิดมาพิการ มีพัฒนาการผิดปกติ',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 38,
    text: 'ตรวจสอบอุปกรณ์เครื่องเล่น ให้อยู่ในสภาพดีก่อนให้เด็กเล่น และดูแลให้เล่นอย่างปลอดภัย',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 39,
    text: 'ส่งเสริมให้เด็กแรกเกิด ถึง 6 ปี ทุกคน ได้รับการประเมิน พัฒนาการและฉีดวัคซีน ตามที่ควรได้รับ',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 40,
    text: 'ปฏิบัติ หรือส่งเสริมให้ผู้หญิง อายุ 20 ปีขึ้นไป สามารถตรวจ เต้านมด้วยตนเอง อย่างน้อยเดือนละ 1 ครั้ง เพื่อเฝ้าระวัง มะเร็งเต้านม',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
  {
    id: 41,
    text: 'ปฏิบัติ หรือ ส่งเสริมให้ผู้หญิง อายุ 30 - 60 ปี เข้ารับการตรวจคัดกรองมะเร็งปากมดลูก อย่างน้อย 5 ปีครั้ง ในกรณีปกติ',
    options: ['ทำได้ง่ายมาก', 'ทำได้ง่าย', 'ทำได้ยาก', 'ทำได้ยากมาก'],
  },
];

// Combined option scores
const optionScores = {
  'ทำได้ง่ายมาก': 4,
  'ทำได้ง่าย': 3,
  'ทำได้ยาก': 2,
  'ทำได้ยากมาก': 1,
  'เข้าใจง่ายมาก': 4,
  'เข้าใจง่าย': 3,
  'เข้าใจยาก': 2,
  'เข้าใจยากมาก': 1,
  'ทุกครั้ง': 4,
  'บ่อยครั้ง': 3,
  'บางครั้ง': 2,
  'ไม่เคยทำ': 1,
};

const Quiz = () => {
  const [answersSet1, setAnswersSet1] = useState({});
  const [answersSet2, setAnswersSet2] = useState({});
  const [answersSet3, setAnswersSet3] = useState({});
  const [answersSet4, setAnswersSet4] = useState({});
  const [answersSet5, setAnswersSet5] = useState({});

  const handleAnswer = (questionId, option, setAnswers) => {
    setAnswers((prevAnswers) => ({
      ...prevAnswers,
      [questionId]: option,
    }));
  };

  const calculateScore = (answers) => {
  return Object.values(answers).reduce((total, answer) => {
    return total + (optionScores[answer] || 0);  
  }, 0);
};


  const handleSubmit = async (e) => {
    e.preventDefault();

    const accessScore = calculateScore(answersSet1);
    const decisionMakingScore = calculateScore(answersSet2);
    const questioning = calculateScore(answersSet3);
    const understanding = calculateScore(answersSet4);
    const practice = calculateScore(answersSet5);
    const overallScore = accessScore + decisionMakingScore + questioning + understanding + practice;

    // Create the result object
    const result = {
        access_score: accessScore,
        decision_making_score: decisionMakingScore,
        questioning_score: questioning,
        understanding_score: understanding,
        practice_score: practice,
        overall_score: overallScore,
    };

    try {
        const response = await fetch('http://localhost:3000/assessment', {
            method: 'POST',
            headers: {
                'Content-Type': 'application/json',
            },
            body: JSON.stringify(result),
        });

        if (!response.ok) {
            throw new Error(`HTTP error! status: ${response.status}`);
        }

        const data = await response.json();
        console.log(data);
    } catch (error) {
        console.error('Error submitting result:', error);
    }
};



  return (
    <form className="quiz-container" onSubmit={handleSubmit}>
      
      {/* Section 1 */}
      <div className="mb-8">
        <div className="flex items-center mb-4">
          <button className="text-2xl text-green-600 mr-2">&lt;</button>
          <h2 className="text-3xl font-bold flex-grow text-start text-green-600">การประเมินศักยภาพของผู้ดูแลสุขภาพ</h2>
        </div>
        <div className='mt-8 ml-7'>
          <p className="text-xl text-black mb-2">
            <strong>แบบประเมินนี้ใช้เพื่อประเมินความรอบรู้ด้านสุขภาพของคนไทย</strong>
          </p>
          <p className="text-xl text-black">
            <strong>ด้านที่ 1 การเข้าถึงข้อมูล</strong> ใน 1 ปีที่ผ่านมา จากข้อความด้านล่าง ท่านตอบได้ว่า......
          </p>
        </div>
      </div>
      {questionsSet1.map((question) => (
        <div key={question.id} className="mb-6 bg-white p-6 rounded-lg shadow-lg">
          <p className="mb-4 text-lg font-medium text-gray-800">{question.id}. {question.text}</p>
          {question.options.map((option) => (
            <div key={option} className="mb-2 flex items-center">
              <input
                type="radio"
                id={`${question.id}-${option}`}
                name={`question1-${question.id}`}
                value={option}
                onChange={() => handleAnswer(question.id, option, setAnswersSet1)}
                checked={answersSet1[question.id] === option}
                className="mr-3 accent-green-600"
              />
              <label htmlFor={`${question.id}-${option}`} className="text-base text-gray-700">{option}</label>
            </div>
          ))}
        </div>
      ))}

      {/* Section 2 */}
      <div className='mt-8 ml-7'>
        <p className="text-xl text-black">
          <strong>ด้านที่ 2 การเข้าใจข้อมูล</strong> ท่านมีความเข้าใจในสิ่งต่อไปนี้ระดับใด
        </p>
      </div>
      {questionsSet2.map((question) => (
        <div key={question.id} className="mb-6 bg-white p-6 rounded-lg shadow-lg">
          <p className="mb-4 text-lg font-medium text-gray-800">{question.id}. {question.text}</p>
          {question.options.map((option) => (
            <div key={option} className="mb-2 flex items-center">
              <input
                type="radio"
                id={`${question.id}-${option}`}
                name={`question2-${question.id}`}
                value={option}
                onChange={() => handleAnswer(question.id, option, setAnswersSet2)}
                checked={answersSet2[question.id] === option}
                className="mr-3 accent-green-600"
              />
              <label htmlFor={`${question.id}-${option}`} className="text-base text-gray-700">{option}</label>
            </div>
          ))}
        </div>
      ))}

      {/* Section 3 */}
      <div className='mt-8 ml-7'>
        <p className="text-xl text-black">
          <strong>ด้านที่ 3 การทบทวน ซักถาม</strong> ท่านทำสิ่งต่อไปนี้ บ่อยแค่ไหน?
        </p>
      </div>
      {questionsSet3.map((question) => (
        <div key={question.id} className="mb-6 bg-white p-6 rounded-lg shadow-lg">
          <p className="mb-4 text-lg font-medium text-gray-800">{question.id}. {question.text}</p>
          {question.options.map((option) => (
            <div key={option} className="mb-2 flex items-center">
              <input
                type="radio"
                id={`${question.id}-${option}`}
                name={`question3-${question.id}`}
                value={option}
                onChange={() => handleAnswer(question.id, option, setAnswersSet3)}
                checked={answersSet3[question.id] === option}
                className="mr-3 accent-green-600"
              />
              <label htmlFor={`${question.id}-${option}`} className="text-base text-gray-700">{option}</label>
            </div>
          ))}
        </div>
      ))}

      {/* Section 4 */}
      <div className='mt-8 ml-7'>
        <p className="text-xl text-black">
          <strong>ด้านที่ 4 การตัดสินใจ</strong> โปรดระบุความยากง่ายในการตัดสินใจในเรื่องต่อไปนี้ (ภายใน 1 ปี)
        </p>
      </div>
      {questionsSet4.map((question) => (
        <div key={question.id} className="mb-6 bg-white p-6 rounded-lg shadow-lg">
          <p className="mb-4 text-lg font-medium text-gray-800">{question.id}. {question.text}</p>
          {question.options.map((option) => (
            <div key={option} className="mb-2 flex items-center">
              <input
                type="radio"
                id={`${question.id}-${option}`}
                name={`question4-${question.id}`}
                value={option}
                onChange={() => handleAnswer(question.id, option, setAnswersSet4)}
                checked={answersSet4[question.id] === option}
                className="mr-3 accent-green-600"
              />
              <label htmlFor={`${question.id}-${option}`} className="text-base text-gray-700">{option}</label>
            </div>
          ))}
        </div>
      ))}

      {/* Section 5 */}
      <div className='mt-8 ml-7'>
        <p className="text-xl text-black">
          <strong>ด้านที่ 5 การปฏิบัติ</strong> โดยทั่วไป ใน 1 ปี ท่านปฏิบัติในเรื่องต่อไปนี้หรือไม่ ยาก ง่ายระดับใด
        </p>
      </div>
      {questionsSet5.map((question) => (
        <div key={question.id} className="mb-6 bg-white p-6 rounded-lg shadow-lg">
          <p className="mb-4 text-lg font-medium text-gray-800">{question.id}. {question.text}</p>
          {question.options.map((option) => (
            <div key={option} className="mb-2 flex items-center">
              <input
                type="radio"
                id={`${question.id}-${option}`}
                name={`question5-${question.id}`}
                value={option}
                onChange={() => handleAnswer(question.id, option, setAnswersSet5)}
                checked={answersSet5[question.id] === option}
                className="mr-3 accent-green-600"
              />
              <label htmlFor={`${question.id}-${option}`} className="text-base text-gray-700">{option}</label>
            </div>
          ))}
        </div>
      ))}

      <div className="mt-6 flex justify-end mr-3">
        <button
          type="submit"
          className="px-6 py-2 bg-green-600 text-white text-lg rounded hover:bg-green-700"
        >
          บันทึก
        </button>
      </div>
    </form>
  );
};

export default Quiz;
